doc/slides/slide_heritage_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Héritage (Partie 2) : Méthodes virtuelles &amp; Classes abstraites</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="slide_compilation.html">Compilation & Directives de préprocesseur </a><a href="slide_pointeur.html">Pointeurs, Références & Allocation Dynamique de Mémoire </a><a href="slide_specificite_c++.html">Spécificités du C++ (indépendantes de la POO) </a><a href="slide_struct_class.html">Structures & Classes </a><a href="slide_encapsulation.html">Encapsulation des données </a><a href="slide_constructeur.html">Constructeur & Destructeur de classe </a><a href="slide_copie.html">Copie d'objets </a><a href="slide_amitie_surcharge.html">Amitié & Surcharge d'opérateur </a><a href="slide_heritage_1.html">Héritage (Partie 1) </a><a href="slide_heritage_2.html">Héritage (Partie 2) </a><a href="slide_template.html">Patrons de fonctions et de classes </a><a href="slide_STL.html">Introduction à la librairie standard </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Héritage (Partie 2) : Méthodes virtuelles &amp; Classes abstraites</h1><hr/>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Rappel sur l&rsquo;héritage simple</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span><span class="org-keyword">class</span> <span class="org-type">polygone</span>
<span class="linenr"> 2: </span>{
<span class="linenr"> 3: </span><span class="org-keyword">public</span>:
<span class="linenr"> 4: </span>  <span class="org-function-name">polygone</span>(<span class="org-keyword">const</span> <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">nbr_segment_</span>);
<span class="linenr"> 5: </span><span class="org-keyword">protected</span>:
<span class="linenr"> 6: </span>  <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">m_nombre_segment</span>;
<span class="linenr"> 7: </span>};
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
<span class="linenr">10: </span>{
<span class="linenr">11: </span><span class="org-keyword">public</span>:
<span class="linenr">12: </span>  <span class="org-function-name">rectangle</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">longueur_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">largeur_</span>);
<span class="linenr">13: </span><span class="org-keyword">private</span>:
<span class="linenr">14: </span>  <span class="org-type">double</span> <span class="org-variable-name">m_longueur</span>;
<span class="linenr">15: </span>  <span class="org-type">double</span> <span class="org-variable-name">m_largeur</span>;
<span class="linenr">16: </span>};
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Rappel sur l&rsquo;héritage simple</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<div class="org-src-container">

<pre class="src src-c++"><span class="linenr"> 1: </span><span class="org-constant">polygone</span>::<span class="org-function-name">polygone</span>(<span class="org-keyword">const</span> <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">nbr_segment_</span>) :
<span class="linenr"> 2: </span>  m_nombre_segment(nbr_segment_)
<span class="linenr"> 3: </span>{
<span class="linenr"> 4: </span>}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span class="org-constant">rectangle</span>::<span class="org-function-name">rectangle</span>(<span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">longueur_</span>, <span class="org-keyword">const</span> <span class="org-type">double</span> <span class="org-variable-name">largeur_</span>) :
<span class="linenr"> 7: </span>  polygone(4),
<span class="linenr"> 8: </span>  m_longueur(longueur_), m_largeur(largeur_)
<span class="linenr"> 9: </span>{
<span class="linenr">10: </span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Liaisons statiques</h2>
<div class="outline-text-2" id="text-unnumbered-3">
</div><div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">Classe <code>polygone</code></h3>
<div class="outline-text-3" id="text-unnumbered-4">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-5" class="outline-3">
<h3 id="unnumbered-5">Classe <code>rectangle</code></h3>
<div class="outline-text-3" id="text-unnumbered-5">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-3">
<h3 id="unnumbered-6">Programme principal</h3>
<div class="outline-text-3" id="text-unnumbered-6">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">polygone</span>  <span class="org-variable-name">my_polygone</span>;
  <span class="org-type">rectangle</span> <span class="org-variable-name">my_rectangle</span>;
  my_polygone.affiche();
  my_rectangle.affiche();
}
</pre>
</div>

<div class="center">
<p>
<b>Comportement souhaité car le compilateur connait, lors de la compilation, le
 type d&rsquo;objet instancié</b>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-7" class="outline-2">
<h2 id="unnumbered-7">Liaisons statiques</h2>
<div class="outline-text-2" id="text-unnumbered-7">
</div><div id="outline-container-unnumbered-8" class="outline-3">
<h3 id="unnumbered-8">Classe <code>polygone</code></h3>
<div class="outline-text-3" id="text-unnumbered-8">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-9" class="outline-3">
<h3 id="unnumbered-9">Classe <code>rectangle</code></h3>
<div class="outline-text-3" id="text-unnumbered-9">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">Programme principal</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">polygone</span>  <span class="org-variable-name">my_polygone</span>;
  <span class="org-type">rectangle</span> <span class="org-variable-name">my_rectangle</span>;
  my_polygone.affiche();
  my_rectangle.<span class="org-constant">polygone</span>::affiche();
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-2">
<h2 id="unnumbered-11">Liaisons statiques</h2>
<div class="outline-text-2" id="text-unnumbered-11">
</div><div id="outline-container-unnumbered-12" class="outline-3">
<h3 id="unnumbered-12">Classe <code>polygone</code></h3>
<div class="outline-text-3" id="text-unnumbered-12">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-13" class="outline-3">
<h3 id="unnumbered-13">Classe <code>rectangle</code></h3>
<div class="outline-text-3" id="text-unnumbered-13">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-14" class="outline-3">
<h3 id="unnumbered-14">Programme principal</h3>
<div class="outline-text-3" id="text-unnumbered-14">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">polygone</span> * <span class="org-variable-name">ptr_polygone1</span> = <span class="org-keyword">new</span> <span class="org-type">polygone</span>;
  <span class="org-type">polygone</span> * <span class="org-variable-name">ptr_polygone2</span> = <span class="org-keyword">new</span> <span class="org-type">rectangle</span>;
  ptr_polygone1-&gt;affiche();
  ptr_polygone2-&gt;affiche();
}
</pre>
</div>

<div class="center">
<p>
<b>Comportement non souhaité car le compilateur ne connait pas, lors de la
 compilation, le type d&rsquo;objet alloué : <span class="underline">liaison statique</span></b>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-15" class="outline-2">
<h2 id="unnumbered-15">Liaisons dynamiques &amp; Méthodes virtuelles</h2>
<div class="outline-text-2" id="text-unnumbered-15">
</div><div id="outline-container-unnumbered-16" class="outline-3">
<h3 id="unnumbered-16">Classe <code>polygone</code></h3>
<div class="outline-text-3" id="text-unnumbered-16">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-keyword">virtual</span> <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>
<div id="outline-container-unnumbered-17" class="outline-3">
<h3 id="unnumbered-17">Classe <code>rectangle</code></h3>
<div class="outline-text-3" id="text-unnumbered-17">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-18" class="outline-3">
<h3 id="unnumbered-18">Programme principal</h3>
<div class="outline-text-3" id="text-unnumbered-18">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-type">polygone</span> * <span class="org-variable-name">ptr_polygone1</span> = <span class="org-keyword">new</span> <span class="org-type">polygone</span>;
  <span class="org-type">polygone</span> * <span class="org-variable-name">ptr_polygone2</span> = <span class="org-keyword">new</span> <span class="org-type">rectangle</span>;
  ptr_polygone1-&gt;affiche();
  ptr_polygone2-&gt;affiche();
}
</pre>
</div>

<div class="center">
<p>
<b>L&rsquo;utilisation d&rsquo;une liaison dynamique via le mot-clé <code>virtual</code> indique au
compilateur que le choix de la méthode ne s&rsquo;effectuera qu&rsquo;à l&rsquo;exécution du code</b>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-19" class="outline-2">
<h2 id="unnumbered-19">Liaisons dynamiques &amp; Méthodes virtuelles</h2>
<div class="outline-text-2" id="text-unnumbered-19">
<div class="center">
<p>
Le processus de virtualisation permet ainsi de <b>redéfinir</b> des méthodes suivant
la finalité de la classe fille
</p>
</div>
</div>

<div id="outline-container-unnumbered-20" class="outline-3">
<h3 id="unnumbered-20">Classe <code>polygone</code></h3>
<div class="outline-text-3" id="text-unnumbered-20">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-keyword">virtual</span> <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};

<span class="org-type">void</span> <span class="org-constant">polygone</span>::<span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>
{
  cout &lt;&lt; <span class="org-string">"Nombre de segment = "</span>
       &lt;&lt; m_nombre_segment &lt;&lt; endl;

}
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-21" class="outline-3">
<h3 id="unnumbered-21">Classe <code>rectangle</code></h3>
<div class="outline-text-3" id="text-unnumbered-21">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">rectangle</span> : <span class="org-keyword">public</span> <span class="org-type">polygone</span>
{
<span class="org-keyword">public</span>:
  <span class="org-type">void</span> <span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>;
  ...
};

<span class="org-type">void</span> <span class="org-constant">rectangle</span>::<span class="org-function-name">affiche</span>() <span class="org-keyword">const</span>
{
  <span class="org-constant">polygone</span>::affiche ();
  cout &lt;&lt; <span class="org-string">"Longueur = "</span> &lt;&lt; m_longueur &lt;&lt; endl;
       &lt;&lt; <span class="org-string">"Largeur  = "</span> &lt;&lt; m_largeur &lt;&lt; endl;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-22" class="outline-2">
<h2 id="unnumbered-22">Classes abstraites</h2>
<div class="outline-text-2" id="text-unnumbered-22">
<ul class="org-ul">
<li>La notion de liaison dynamique permet de redéfinir une méthode au sein de
classes filles : on parle de <b>méthodes virtuelles</b>
</li>

<li>C++ permet la déclaration de <b>méthodes virtuelles pures</b> c&rsquo;est-à-dire des
méthodes dont <b>la définition n&rsquo;est pas donnée</b>
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-23" class="outline-2">
<h2 id="unnumbered-23">Classes abstraites</h2>
<div class="outline-text-2" id="text-unnumbered-23">
<p>
Exemple du jeu d&rsquo;échec :
</p>
<ul class="org-ul">
<li>La classe <code>piece</code> est par construction <b>une classe abstraite</b> : elle déclare
des méthodes <code>affiche()</code>, <code>deplacement()</code> mais ne les définit pas
</li>

<li>La définition n&rsquo;intervient que dans les classes dérivées qui spécialisent les
méthodes en fonction de leur besoin
</li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-24" class="outline-2">
<h2 id="unnumbered-24">Classes abstraites</h2>
<div class="outline-text-2" id="text-unnumbered-24">
</div>
</div>

<div id="outline-container-unnumbered-25" class="outline-2">
<h2 id="unnumbered-25">Classes abstraites</h2>
<div class="outline-text-2" id="text-unnumbered-25">
<div class="org-src-container">

<pre class="src src-c++"><span class="org-preprocessor">#include</span> <span class="org-string">"pion.h"</span>
<span class="org-preprocessor">#include</span> <span class="org-string">"tour.h"</span>
<span class="org-type">int</span> <span class="org-function-name">main</span>()
{
  <span class="org-keyword">const</span> <span class="org-type">size_t</span> <span class="org-variable-name">nbr_pieces</span> = 2;
  piece * pieces[nbr_pieces];

  pieces[0] = <span class="org-keyword">new</span> <span class="org-type">pion</span>;
  pieces[1] = <span class="org-keyword">new</span> <span class="org-type">tour</span>;

  <span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">i</span> = 0; i &lt; nbr_pieces; ++i)
  {
    pieces[i]-&gt;affiche();
  }
}
</pre>
</div>

<div class="center">
<p>
Étant donné le canevas fourni par la déclaration de la classe <code>piece</code>, libre à
chacun de développer, de façon indépendante, sa propre implémentation de <code>piece</code>
en définissant ces fonctionnalités
</p>
</div>
</div>
</div>
</div>
</body>
</html>
